# Operations

In [29]:
import pandas as pd

In [31]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[555,666,777,555],
                   'col3':['abc','def','pqr','xyz']})
df

   col1  col2 col3
0     1   555  abc
1     2   666  def
2     3   777  pqr
3     4   555  xyz

## Info on Unique Values

In [32]:
df['col2'].unique()

array([555, 666, 777], dtype=int64)

In [33]:
df['col2'].nunique()

3

In [34]:
df['col2'].value_counts()

555    2
666    1
777    1
Name: col2, dtype: int64

## Selecting Data

In [35]:
newdf = df[(df['col1']>2)]
newdf

   col1  col2 col3
2     3   777  pqr
3     4   555  xyz

In [37]:
# Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==555)]
newdf

   col1  col2 col3
3     4   555  xyz

## Applying Functions

In [38]:
def times2(x):
  return x*2

In [39]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [40]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [41]:
df['col1'].sum()

10

In [42]:
# we can also apply lambda expressions
df['col1'].apply(lambda x:x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

## Removing a Column

In [43]:
# Permanantly remove a column
del df['col1']

In [44]:
df

   col2 col3
0   555  abc
1   666  def
2   777  pqr
3   555  xyz

## Get column and index names

In [45]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [46]:
df.index

RangeIndex(start=0, stop=4, step=1)

## Sorting and Ordering a DataFrame

In [47]:
df

   col2 col3
0   555  abc
1   666  def
2   777  pqr
3   555  xyz

In [48]:
df.sort_values(by='col2') #inplace=False by default

   col2 col3
0   555  abc
3   555  xyz
1   666  def
2   777  pqr

## Find Null Values or check for Null Values

In [49]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [50]:
# Drop rows with NaN Values
df.dropna()

   col2 col3
0   555  abc
1   666  def
2   777  pqr
3   555  xyz

## Filling NaN values with something else

In [53]:
import numpy as np

In [54]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [55]:
df.fillna('FILL')

   col1   col2 col3
0   1.0   FILL  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  FILL  444.0  xyz

## Pivot Table

In [56]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [57]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [58]:
df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

<hr>